{
  "architectures": [
    "ModernBertForSequenceClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": null,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "dtype": "bfloat16",
  "embedding_dropout": 0.0,
  "eos_token_id": null,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "id2label": {
    "0": "part_of",
    "1": "uses",
    "2": "implements",
    "3": "depends_on",
    "4": "supports",
    "5": "produces",
    "6": "stores",
    "7": "detects",
    "8": "instance_of",
    "9": "example_of",
    "10": "member_of",
    "11": "none"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "label2id": {
    "depends_on": 3,
    "detects": 7,
    "example_of": 9,
    "implements": 2,
    "instance_of": 8,
    "member_of": 10,
    "none": 11,
    "part_of": 0,
    "produces": 5,
    "stores": 6,
    "supports": 4,
    "uses": 1
  },
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "pad_token_id": 50283,
  "position_embedding_type": "absolute",
  "repad_logits_with_grad": false,
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "transformers_version": "4.57.6",
  "vocab_size": 50368
}
